Tekla.Structures.Analysis.AnalysisResult.LoadCaseTypeEnum
The load case type.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseTypeEnum.CASE
Load case (not a combination to be considered in design).

Tekla.Structures.Analysis.AnalysisResult.LoadCaseTypeEnum.COMBINATION_ULS
Ultimate limit state combination.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseTypeEnum.COMBINATION_SLS
Service limit state combination.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseTypeEnum.COMBINATION
Combination (not limit state).

Tekla.Structures.Analysis.AnalysisResult.LoadCaseTypeEnum.ENVELOPE
Envelope (from group of combinations).